In [1]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [2]:
df = pd.read_csv("BuyerRatio (1).csv ")

In [3]:
df

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [4]:
df.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [7]:
df.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [ ]:
Inputs are 4 discrete variables(east,west,north,south).

Output is also discrete. We are trying to find out if proportions of male and female are
similar or not across the regions

We proceed with chi-square test.

In [18]:
East=df['East'].mean()
East

242.5

In [17]:
West=df['West'].mean()
West

832.5

In [16]:
North=df['North'].mean()
North

743.5

In [15]:
South=df['South'].mean()
South

410.0

In [ ]:
The null and alternative hypothesis are:
Ho= Proportions of Male and Female are same.  H0:μ1=μ2=μ3=μ4=μ5

Ha= Proportions of Male and Female are not same.   Ha:μ1≠μ2≠μ3≠μ4

In [19]:
alpha=0.05
Male = [50,142,131,70]
Female=[435,1523,1356,750]
Sales=[Male,Female]
Sales

[[50, 142, 131, 70], [435, 1523, 1356, 750]]

In [21]:
chiStats = stats.chi2_contingency(Sales)
print('Test t=%f p-value=%f' % (chiStats[0], chiStats[1]))
print('Interpret by p-Value')

Test t=1.595946 p-value=0.660309
Interpret by p-Value

In [ ]:
Interpret by p-Value
we accept null hypothesis
Conclusion: Proportion of male and female across regions is same.